# CreateSeparator

## Description
Creates a Layout Manager image separator.

```pascal
PROCEDURE CreateSeparator(
				dialogID      : LONGINT;
				componentID   : LONGINT;
				widthInPixels : INTEGER);
```

```python

def vs.CreateSeparator(dialogID, componentID, widthInPixels):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|widthInPixels|INTEGER||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern